{
	"@metadata": {
		"authors": [
			"Kalakpagh"
		]
	},
	"mwoauth-consumer-grantshelp": "\"Grants\" nyɛla din tiri \"user account\" ya'shɛli din pun ma la. A yi niŋ \"grant\" kpɛ bɛ yɛn ti a la soli ka a mali ya'shɛli a \"user account\" ni ka. Lihimi [[Special:ListGrants|table of grants]] ŋɔ nya lahabali pahi.\n\n\"Risky grants\" nyɛ bɛn saɣiri n-tiri shɛli. \"Grant\" shɛŋa bɛ ni bɛ saɣi n-ti yala nyɛla din to di yi ti niŋ ka so yina n-ti mali di ninmohi. \"Grant\" shɛŋa din mali \"vandalism risk\" (<span class=\"mw-grantriskgroup-vandalism\"></span>) nyɛla bɛ ni tooi zaŋ shɛli nyɛhi binshɛŋa zaa din di yɛn di saha pɔi ka naayi nyɛhi. \"Grant\" shɛŋa din mali \"security risk\" (<span class=\"mw-grantriskgroup-security\"></span>) nyɛla din ni tooi tum barina din mali yaa  (kamani nayiɣi tali). \"Internal grants\"(<span class=\"mw-grantriskgroup-internal\"></span>) nyɛla  \"site operator\" koŋko ni mali shɛli, ka bɛ bi tooi n-tiri ninvuɣ shɛba ban bori li. Pahimi suɣulo di ti suhi m-bo \"risky grants\" di yi ti pala di gbaagi a la talahi",
	"mwoauthmanagemygrants-basic-tooltip": "'''Bɔ zuɣu ka n-ku tooi mali tibu ŋɔ niŋ?'''\nLala tibu ŋɔ nyɛla din tiri a piligu laɣimbu soli bɔbu yaa ka di bori li ni di tum viɛnyɛla. Di yi niŋ ka a bi bori laɣimbu soli bɔbu ŋɔ yaa, nyini yihimi soli ŋɔ bɔbu nyɛbu.",
	"mwoauthmanagemygrants-authonly-tooltip": "'''Bɔ zuɣu ka n-ku tooi mali tibu ŋɔ niŋ?'''\nDi yi niŋ ka a bi bori laɣimbu soli bɔbu mali yaa ŋɔ, nyini yihimi lala soli bɔbu ŋɔ nyɛbu.",
	"logentry-mwoauthconsumer-propose-autoapproved": "$1 {{GENDER:$2|proposed}} ŋun nyɛri o bindirigu \"OAuth\" sani  (ŋun ku tooi nya o bindirigu o maŋmaŋ saafii $4) ka bɛ daa saɣi n-ti li",
	"log-action-filter-mwoauthconsumer-propose-autoapproved": "OAuth bindiri dira saɣi (auto-approved)",
	"mwoauth-oauth2-error-serverexception-withhint": "$1\n\n\"Debug\" din pahiri lahabali\n: $2",
	"mwoauth-oauth2-error-server-error": "Din tiri soli ŋɔ nyɛla din nya din di bi tihiri ni din nya shɛli ka dizuɣu che ka di bi tooi pali nia maa.\n\n\nDebug lahabali: $1"
}
