{
	"@metadata": {
		"authors": [
			"Bjh21",
			"Dreamy Jazz",
			"Mako001",
			"Reedy",
			"Samwilson",
			"Shirayuki",
			"Samthecrazyman"
		]
	},
	"mwoauth-desc": "Allows usage of OAuth 1.0a and OAuth 2.0 for API authorisation",
	"mwoauth-consumer-owner-only-help": "Selecting this option will cause the consumer to be automatically approved and accepted for use by $1. It will not be usable by any other user, and the usual authorisation flow will not function. Actions taken using this consumer will not be tagged.",
	"mwoauthconsumerregistration-propose-text-oauth1": "Developers should use the form below to propose a new OAuth 1.0a consumer (see the [https://www.mediawiki.org/wiki/Special:MyLanguage/Extension:OAuth extension documentation] for more details). After submitting this form, you will receive a token that your application will use to identify itself to MediaWiki. Depending on what capabilities you request, an OAuth administrator might need to approve your application before it can be authorised by other users.\n\nA few recommendations and remarks:\n* Try to use as few grants as possible. Avoid grants that are not actually needed now.\n* Versions are of the form \"major.minor.release\" (the last two being optional) and increase as grant changes are needed.\n* Please provide a public RSA key (in PEM format) if possible; otherwise a (less secure) secret token will have to be used.\n* You can use a project ID to restrict the consumer to a single project on this site (use \"*\" for all projects).",
	"mwoauthconsumerregistration-propose-text-oauth2": "Developers should use the form below to request a token for a new OAuth 2.0 client (see the [https://www.mediawiki.org/wiki/Special:MyLanguage/Extension:OAuth extension documentation] for more details). After submitting this form, you will receive a token that your application will use to identify itself to MediaWiki. Depending on what capabilities you request, an OAuth administrator might need to approve your application before it can be authorised by other users.\n\nA few recommendations and remarks:\n* Try to use as few scopes as possible. Avoid scopes that are not actually needed now.\n* Versions are of the form \"major.minor.release\" (the last two being optional) and increase as scope changes are needed.\n* You can use a project ID to restrict the consumer to a single project on this site (use \"*\" for all projects).",
	"mwoauthmanagemygrants-text": "This page lists any applications that can use your account. For any such application, the scope of its access is limited by the permissions that you granted to the application when you authorised it to act on your behalf. If you separately authorised an application to access different sister projects on your behalf, then you will see separate configuration for each such project below.\n\nConnected applications access your account by using the OAuth protocol. <span class=\"plainlinks\">([https://www.mediawiki.org/wiki/Special:MyLanguage/Help:OAuth Learn more about connected applications])</span>",
	"mwoauthmanagemygrants-renounce": "Deauthorise",
	"mwoauthdatastore-access-token-not-found": "No approved grant was found for that authorisation token.",
	"mwoauth-invalid-authorization-title": "OAuth authorisation error",
	"mwoauth-invalid-authorization": "The authorisation headers in your request are not valid: $1",
	"mwoauth-invalid-authorization-wrong-wiki": "The authorisation headers in your request are not valid for $1",
	"mwoauth-invalid-authorization-invalid-user": "The authorisation headers in your request are for a user that does not exist here",
	"mwoauth-invalid-authorization-wrong-user": "The authorisation headers in your request are for a different user",
	"mwoauth-invalid-authorization-blocked-user": "The authorisation headers in your request are for a user who is blocked",
	"mwoauth-granttype-normal": "Request authorisation for specific permissions.",
	"mwoauth-oauth2-granttype-auth-code": "Authorisation code",
	"mwoauth-oauth2-error-server-error": "The authorisation server encountered an unexpected condition that prevented it from fulfilling the request.\n\nDebug information: $1",
	"mwoauth-oauth2-error-unauthorized-client": "The client is not authorised to request an authorisation code using this method.",
	"mwoauth-oauth2-error-access-denied": "The resource owner or authorisation server denied the request.",
	"mwoauth-oauth2-error-unsupported-response-type": "The authorisation server does not support obtaining an authorisation code using this method.",
	"mwoauth-oauth2-error-temporarily-unavailable": "The authorisation server is currently unable to handle the request due to a temporary overloading or maintenance of the server."
}
